app/controllers/builds_controller.rb

SELECT * FROM `builds` WHERE (`builds`.`id` = 25)
---
  def tlogs
    @p = Project.get_cache(params[:project_id])
    @build = Build.find(params[:id])

SELECT * FROM `builds` WHERE (`builds`.`id` = 1)
---
  def flogs
    @p = Project.get_cache(params[:project_id])
    @build = Build.find(params[:id])