app/controllers/projects_controller.rb

  def create
    @p = Project.new(params[:project])
    @p.owner_id = @u.id
    respond_to do |format|
      if @p.save
        ProjectUser.create({:user_id => @u.id ,:project_id => @p.id})
        Page.create(:project_id =>@p.id,:user_id =>@u.id,:title=>@p.name,:content=>"hello")
        Event.create({:project_id=>@p.id,:user_id =>@u.id,:type_id =>2,:content_id => @p.id,:operate_id=>1})
---
INSERT INTO `projects` (`name`, `updated_at`, `desc`, `owner_id`, `created_at`) VALUES('Êàø‰∫ß', '2008-12-17 14:11:34', 'Êàø‰∫ß', 1, '2008-12-17 14:11:34')
INSERT INTO `project_users` (`project_id`, `updated_at`, `user_id`, `created_at`) VALUES(1, '2008-12-17 14:11:35', 1, '2008-12-17 14:11:35')
INSERT INTO `pages` (`project_id`, `updated_at`, `title`, `content`, `user_id`, `created_at`) VALUES(1, '2008-12-17 14:11:35', 'Êàø‰∫ß', 'hello', 1, '2008-12-17 14:11:35')
INSERT INTO `events` (`content_id`, `project_id`, `updated_at`, `operate_id`, `type_id`, `user_id`, `created_at`) VALUES(1, 1, '2008-12-17 14:11:35', 1, 2, 1, '2008-12-17 14:11:35')