app/controllers/seleniumlogs_controller.rb

SELECT * FROM `builds` WHERE (`builds`.`id` = 25)
---
  def show
    @p = Project.get_cache(params[:project_id])
    @build = Build.find(params[:build_id])