app/controllers/tickets_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tickets` WHERE (`tickets`.project_id = 1)
---
  def index
    @p = Project.find(params[:project_id])
    @q = params[:q]
    if @q == nil
      @tickets = @p.tickets
    else
      @list =  @q.split(":")
      @qtpye = @list[0]
      case @qtpye
      when "tagged" then @tickets = @p.tickets.find_tagged_with(@list[1])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
---
  def show
    @tags = Tag.find(:all)
    @p = Project.find(params[:project_id])
    @ticket = Ticket.find(params[:id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
INSERT INTO `tags` (`name`) VALUES('ruby')
INSERT INTO `tickets` (`assigned_id`, `updated_at`, `project_id`, `title`, `desc`, `user_id`, `created_at`, `state`) VALUES(1, '2008-12-17 17:25:43', 1, 'Êù®ÂÜçÊñ∞', 'ÂéãÁº©ÊâçÈòøÂæ∑', 1, '2008-12-17 17:25:43', 0)
INSERT INTO `events` (`content_id`, `project_id`, `updated_at`, `operate_id`, `type_id`, `user_id`, `created_at`) VALUES(1, 1, '2008-12-17 17:25:43', 1, 1, 1, '2008-12-17 17:25:43')
---
  def create
    #@p = Project.find(params[:project_id])
    @p = Project.find(params[:project_id])
    @ticket = Ticket.new(params[:ticket])
    @ticket.tag_list = params[:ticket][:tag].gsub(/\s/,",")
    @ticket.user_id = @u.id
    @ticket.project_id = params[:project_id]
    @ticket.state = 0
    respond_to do|format|
      if @ticket.save
        format.html do
          Event.create({:project_id=>@ticket.project_id,:user_id =>@u.id,:type_id =>1,:content_id => @ticket.id,:operate_id=>1,:status =>@ticket.state})