app/controllers/users_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 8)
INSERT INTO `project_users` (`project_id`, `updated_at`, `user_id`, `created_at`) VALUES(8, '2008-12-17 14:59:25', 3, '2008-12-17 14:59:25')
---
  def join
    @p = Project.find(params[:project_id])
    @projectUser =  ProjectUser.new({:project_id =>params[:project_id],:user_id =>params[:id]})
    respond_to do |format|
      if @projectUser.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
    if params[:project_id] && params[:project_id] != nil
    @p = Project.get_cache(params[:project_id])
    @users = @p.users
    @owner = User.get_cache(@p.owner_id)
    else
      @users =User.find(:all)

INSERT INTO `photos` (`content_type`, `thumbnail`, `size`, `updated_at`, `album_id`, `filename`, `height`, `user_id`, `parent_id`, `width`, `created_at`) VALUES('image/jpeg', NULL, 0, '2008-12-17 14:55:45', NULL, 'rentout_1225300645406.jpg', 927, NULL, NULL, 1243, '2008-12-17 14:55:45')
INSERT INTO `users` (`name`, `salt`, `updated_at`, `login_key`, `login_key_expires_at`, `last_seen_at`, `password_hash`, `photo_id`, `email`, `created_at`) VALUES('Â∞èÊñ∞', '8047962389c281bf659598f76acabc11b4dcadd4', '2008-12-17 14:55:48', NULL, NULL, NULL, '36e902eb7f82532ba7ff0d88eb68ea6e71002017', 7, 'yangzx554@gmail.com', '2008-12-17 14:55:48')
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.save!
    u = User.new
    u.name = params[:user][:name]
    u.password = params[:user][:password]
    u.password_confirmation = params[:user][:password_confirmation]
    u.email = params[:user][:email]
    u.photo_id =@photo.id
    respond_to do |format|
      if u.save