app/controllers/welcome_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `events` WHERE (`events`.user_id = 3)
---
  def index
    @projects = Project.find(:all)
    @events = Event.find_all_by_user_id(@u.id,:order=>"created_at Desc")